Revit 2027 API
CriticalPathCollector Methods
The CriticalPathCollector type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCalculatedFlow |  Gets the calculated flow of the network.
GetCalculatedPressureDrop |  Gets the calculated pressure drop of the network.
GetCriticalPathCollectorIterator |  Gets the critical path iterator to traverse individual segment.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToNetworkSegmentIds |  Returns the list of analytical segment ids on the network critical path.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace